Tekla Open API Reference for Tekla Structures 2025
AngleDimension.GetDimensionSet Method
 The angle dimension doesn't have a dimension set.
 Namespace: Tekla.Structures.Drawing
 Assembly: Tekla.Structures.Drawing (in Tekla.Structures.Drawing.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public override DimensionSetBase GetDimensionSet()
Public Overrides Function GetDimensionSet As DimensionSetBase
Return Value
Type: DimensionSetBase
An exception.
Exceptions
Exception | Condition
InvalidOperationException | Thrown always.
See Also
Reference
AngleDimension Class
GetDimensionSet Overload
Tekla.Structures.Drawing Namespace